    # Japanese Vocabulary List / 日本語語彙リスト
    # Similar to English words.txt format
    # Includes common words found in ASR error correction tasks

    # Format: word | reading | frequency | part_of_speech

    # Particles (助詞)
    は|wa|very_high|particle
    が|ga|very_high|particle
    を|wo|very_high|particle
    に|ni|very_high|particle
    で|de|very_high|particle
    と|to|very_high|particle
    から|kara|very_high|particle
    まで|made|high|particle
    の|no|very_high|particle
    へ|e|high|particle
    も|mo|very_high|particle
    や|ya|high|particle
    か|ka|very_high|particle

    # Common verbs (動詞)
    する|suru|very_high|verb
    いる|iru|very_high|verb
    ある|aru|very_high|verb
    なる|naru|very_high|verb
    言う|iu|very_high|verb
    思う|omou|very_high|verb
    見る|miru|very_high|verb
    聞く|kiku|very_high|verb
    話す|hanasu|very_high|verb
    書く|kaku|very_high|verb
    読む|yomu|very_high|verb
    行く|iku|very_high|verb
    来る|kuru|very_high|verb
    帰る|kaeru|high|verb
    出る|deru|high|verb
    入る|hairu|high|verb
    食べる|taberu|very_high|verb
    飲む|nomu|high|verb
    寝る|neru|high|verb
    起きる|okiru|high|verb
    働く|hataraku|high|verb
    休む|yasumu|high|verb
    待つ|matsu|high|verb
    会う|au|high|verb
    買う|kau|high|verb
    売る|uru|medium|verb
    作る|tsukuru|high|verb
    使う|tsukau|high|verb
    持つ|motsu|high|verb
    取る|toru|high|verb
    渡る|wataru|medium|verb
    走る|hashiru|medium|verb
    歩く|aruku|medium|verb
    座る|suwaru|medium|verb
    立つ|tatsu|medium|verb
    開く|hiraku|high|verb
    閉じる|tojiru|medium|verb
    始まる|hajimaru|high|verb
    終わる|owaru|high|verb
    続く|tsuzuku|high|verb
    変わる|kawaru|high|verb
    増える|fueru|high|verb
    減る|heru|medium|verb
    上がる|agaru|high|verb
    下がる|sagaru|medium|verb
    出す|dasu|high|verb
    受ける|ukeru|high|verb
    送る|okuru|high|verb
    返す|kaesu|medium|verb
    借りる|kariru|medium|verb
    貸す|kasu|medium|verb
    教える|oshieru|high|verb
    習う|narau|high|verb
    学ぶ|manabu|high|verb
    知る|shiru|very_high|verb
    分かる|wakaru|very_high|verb
    できる|dekiru|very_high|verb
    なくす|nakusu|medium|verb
    見つける|mitsukeru|high|verb
    探す|sagasu|high|verb
    壊す|kowasu|medium|verb
    直す|naosu|high|verb
    修正する|shuusei_suru|high|verb
    訂正する|teisei_suru|high|verb

    # Common adjectives (形容詞)
    良い|yoi|very_high|adjective
    悪い|warui|very_high|adjective
    大きい|ookii|very_high|adjective
    小さい|chiisai|very_high|adjective
    高い|takai|very_high|adjective
    低い|hikui|high|adjective
    長い|nagai|high|adjective
    短い|mijikai|high|adjective
    新しい|atarashii|very_high|adjective
    古い|furui|high|adjective
    多い|ooi|very_high|adjective
    少ない|sukunai|high|adjective
    広い|hiroi|high|adjective
    狭い|semai|medium|adjective
    厚い|atsui|medium|adjective
    薄い|usui|medium|adjective
    速い|hayai|high|adjective
    遅い|osoi|high|adjective
    早い|hayai|very_high|adjective
    近い|chikai|high|adjective
    遠い|tooi|high|adjective
    強い|tsuyoi|high|adjective
    弱い|yowai|medium|adjective
    明るい|akarui|high|adjective
    暗い|kurai|medium|adjective
    重い|omoi|medium|adjective
    軽い|karui|medium|adjective
    難しい|muzukashii|very_high|adjective
    易しい|yasashii|high|adjective
    美しい|utsukushii|high|adjective
    楽しい|tanoshii|high|adjective
    嬉しい|ureshii|high|adjective
    悲しい|kanashii|high|adjective
    怖い|kowai|medium|adjective
    痛い|itai|medium|adjective
    正しい|tadashii|high|adjective
    間違い|machigai|high|noun

    # Na-adjectives (形容動詞)
    綺麗|kirei|high|na_adjective
    有名|yuumei|high|na_adjective
    便利|benri|high|na_adjective
    不便|fuben|medium|na_adjective
    静か|shizuka|high|na_adjective
    賑やか|nigiyaka|medium|na_adjective
    簡単|kantan|very_high|na_adjective
    複雑|fukuzatsu|high|na_adjective
    大切|taisetsu|very_high|na_adjective
    重要|juuyou|very_high|na_adjective
    必要|hitsuyou|very_high|na_adjective
    自由|jiyuu|high|na_adjective
    安全|anzen|high|na_adjective
    危険|kiken|high|na_adjective
    健康|kenkou|high|na_adjective
    丈夫|joubu|medium|na_adjective
    元気|genki|high|na_adjective
    真面目|majime|high|na_adjective
    親切|shinsetsu|high|na_adjective
    失礼|shitsurei|high|na_adjective
    残念|zannen|high|na_adjective
    幸せ|shiawase|high|na_adjective
    確か|tashika|high|na_adjective

    # Common nouns (名詞)
    人|hito|very_high|noun
    人間|ningen|high|noun
    子供|kodomo|very_high|noun
    大人|otona|high|noun
    男|otoko|high|noun
    女|onna|high|noun
    学生|gakusei|very_high|noun
    先生|sensei|very_high|noun
    会社|kaisha|very_high|noun
    会社員|kaishain|high|noun
    仕事|shigoto|very_high|noun
    家|ie|very_high|noun
    家族|kazoku|very_high|noun
    父|chichi|high|noun
    母|haha|high|noun
    兄|ani|high|noun
    姉|ane|high|noun
    弟|otouto|high|noun
    妹|imouto|high|noun
    友達|tomodachi|very_high|noun
    時間|jikan|very_high|noun
    日|hi|very_high|noun
    今日|kyou|very_high|noun
    明日|ashita|very_high|noun
    昨日|kinou|very_high|noun
    朝|asa|high|noun
    昼|hiru|high|noun
    夜|yoru|high|noun
    午前|gozen|high|noun
    午後|gogo|high|noun
    年|toshi|very_high|noun
    月|tsuki|very_high|noun
    週|shuu|high|noun
    場所|basho|very_high|noun
    所|tokoro|very_high|noun
    国|kuni|very_high|noun
    都市|toshi|high|noun
    街|machi|high|noun
    駅|eki|high|noun
    学校|gakkou|very_high|noun
    大学|daigaku|very_high|noun
    病院|byouin|high|noun
    店|mise|high|noun
    レストラン|resutoran|high|noun
    銀行|ginkou|high|noun
    郵便局|yuubinkyoku|medium|noun
    図書館|toshokan|high|noun
    公園|kouen|high|noun
    道|michi|high|noun
    道路|douro|high|noun
    橋|hashi|high|noun
    川|kawa|high|noun
    山|yama|high|noun
    海|umi|high|noun
    空|sora|high|noun
    天気|tenki|high|noun
    雨|ame|high|noun
    雪|yuki|high|noun
    風|kaze|high|noun
    水|mizu|very_high|noun
    お茶|ocha|high|noun
    コーヒー|koohii|high|noun
    食事|shokuji|high|noun
    料理|ryouri|high|noun
    朝食|choushoku|medium|noun
    昼食|chuushoku|medium|noun
    夕食|yuushoku|medium|noun
    お金|okane|very_high|noun
    買い物|kaimono|high|noun
    本|hon|very_high|noun
    新聞|shinbun|high|noun
    雑誌|zasshi|medium|noun
    映画|eiga|high|noun
    音楽|ongaku|high|noun
    スポーツ|supootsu|high|noun
    趣味|shumi|high|noun
    旅行|ryokou|high|noun
    休み|yasumi|high|noun
    休暇|kyuuka|medium|noun
    問題|mondai|very_high|noun
    答え|kotae|very_high|noun
    質問|shitsumon|very_high|noun
    回答|kaitou|very_high|noun
    意見|iken|very_high|noun
    話|hanashi|very_high|noun
    言葉|kotoba|very_high|noun
    声|koe|高|noun
    顔|kao|high|noun
    頭|atama|high|noun
    目|me|high|noun
    耳|mimi|high|noun
    口|kuchi|high|noun
    手|te|very_high|noun
    足|ashi|high|noun
    体|karada|high|noun
    心|kokoro|high|noun
    気持ち|kimochi|high|noun
    病気|byouki|high|noun
    怪我|kega|medium|noun
    薬|kusuri|high|noun
    服|fuku|high|noun
    靴|kutsu|high|noun
    眼鏡|megane|medium|noun
    鞄|kaban|medium|noun
    傘|kasa|medium|noun
    時計|tokei|high|noun
    鍵|kagi|medium|noun
    机|tsukue|high|noun
    椅子|isu|high|noun
    窓|mado|high|noun
    扉|tobira|medium|noun
    部屋|heya|high|noun
    電話|denwa|very_high|noun
    車|kuruma|very_high|noun
    電車|densha|very_high|noun
    バス|basu|high|noun
    飛行機|hikouki|high|noun
    船|fune|high|noun
    自転車|jitensha|high|noun

    # Business/Work terms (ビジネス用語)
    会議|kaigi|very_high|noun
    プロジェクト|purojekuto|very_high|noun
    計画|keikaku|very_high|noun
    提案|teian|high|noun
    報告|houkoku|high|noun
    資料|shiryou|very_high|noun
    書類|shorui|high|noun
    契約|keiyaku|high|noun
    予算|yosan|high|noun
    売上|uriage|high|noun
    利益|rieki|high|noun
    顧客|kokyaku|high|noun
    取引|torihiki|high|noun
    交渉|koushou|high|noun
    決定|kettei|high|noun
    実行|jikkou|high|noun
    達成|tassei|high|noun
    成功|seikou|very_high|noun
    失敗|shippai|high|noun
    課題|kadai|high|noun
    目標|mokuhyou|very_high|noun
    結果|kekka|very_high|noun
    効果|kouka|high|noun
    改善|kaizen|high|noun
    開発|kaihatsu|high|noun
    製品|seihin|high|noun
    商品|shouhin|high|noun
    サービス|saabisu|high|noun
    品質|hinshitsu|high|noun
    管理|kanri|high|noun
    システム|shisutemu|very_high|noun
    技術|gijutsu|very_high|noun
    方法|houhou|very_high|noun

    # Administrative/Government terms (行政用語)
    政府|seifu|very_high|noun
    政治|seiji|very_high|noun
    政策|seisaku|very_high|noun
    法律|houritsu|high|noun
    規則|kisoku|high|noun
    制度|seido|high|noun
    税金|zeikin|high|noun
    選挙|senkyo|high|noun
    国民|kokumin|high|noun
    市民|shimin|high|noun
    社会|shakai|very_high|noun
    経済|keizai|very_high|noun
    教育|kyouiku|very_high|noun
    文化|bunka|very_high|noun
    歴史|rekishi|very_high|noun
    伝統|dentou|high|noun

    # Action/Process terms (動作・プロセス)
    作業|sagyou|very_high|noun
    手順|tejun|high|noun
    工程|koutei|high|noun
    過程|katei|high|noun
    段階|dankai|high|noun
    準備|junbi|very_high|noun
    確認|kakunin|very_high|noun
    検討|kentou|high|noun
    調査|chousa|high|noun
    研究|kenkyuu|high|noun
    分析|bunseki|high|noun
    評価|hyouka|high|noun
    判断|handan|high|noun
    決断|ketsudan|high|noun
    選択|sentaku|high|noun
    移行|ikou|high|noun
    変更|henkou|high|noun
    修正|shuusei|very_high|noun
    訂正|teisei|high|noun
    対応|taiou|very_high|noun
    処理|shori|high|noun
    操作|sousa|high|noun

    # Abstract concepts (抽象概念)
    事|koto|very_high|noun
    物|mono|very_high|noun
    為|tame|very_high|noun
    様|you|high|noun
    事実|jijitsu|high|noun
    真実|shinjitsu|high|noun
    理由|riyuu|very_high|noun
    原因|genin|high|noun
    理解|rikai|very_high|noun
    説明|setsumei|very_high|noun
    情報|jouhou|very_high|noun
    知識|chishiki|high|noun
    経験|keiken|high|noun
    能力|nouryoku|high|noun
    力|chikara|high|noun
    努力|doryoku|very_high|noun
    注意|chuui|high|noun
    関心|kanshin|high|noun
    興味|kyoumi|high|noun
    希望|kibou|high|noun
    願い|negai|high|noun
    夢|yume|high|noun
    目的|mokuteki|very_high|noun
    意味|imi|very_high|noun
    価値|kachi|high|noun
    影響|eikyou|high|noun
    効率|kouritsu|high|noun
    速度|sokudo|medium|noun
    程度|teido|high|noun
    状態|joutai|high|noun
    状況|joukyou|very_high|noun
    場合|baai|very_high|noun
    条件|jouken|high|noun
    基準|kijun|high|noun
    規模|kibo|medium|noun
    範囲|han'i|high|noun
    全体|zentai|high|noun
    部分|bubun|high|noun
